Catalogs/омг_ПриложенияКЛицензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>омг_ПриложенияКЛицензии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.омг_МедицинскиеЛицензии</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроизводственнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СостоянияМедицинскихЛицензий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подвиды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодвидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.омг_ВидыЛицензируемойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/омг_ЛицензированныеВидыДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_ЛицензированныеВидыДеятельности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_МедицинскиеЛицензии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бессрочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СостоянияМедицинскихЛицензий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодвидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ВидыЛицензируемойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ПриложенияКЛицензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/омг_СостоянияМедицинскихЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>омг_СостоянияМедицинскихЛицензий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформляется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/омг_ПриложенияКЛицензии/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    Бессрочное    = Истина;
    Состояние     = Перечисления.омг_СостоянияМедицинскихЛицензий.Действует;
    Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

    Если Бессрочное Тогда
        Индекс = ПроверяемыеРеквизиты.Найти("ДатаОкончания");
        Если Индекс <> Неопределено Тогда
            ПроверяемыеРеквизиты.Удалить(Индекс);
        КонецЕсли;
    ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания <= ДатаВыдачи Тогда
        ОбщегоНазначения.СообщитьПользователю(
            "Дата окончания должна быть больше даты выдачи",
            ЭтотОбъект, "ДатаОкончания", , Отказ);
    КонецЕсли;

    Если Подвиды.Количество() = 0 Тогда
        ОбщегоНазначения.СообщитьПользователю(
            "Не заполнены подвиды лицензируемой деятельности",
            ЭтотОбъект, "Подвиды", , Отказ);
    КонецЕсли;

    Проверенные = Новый Соответствие;
    Для Каждого СтрокаТЧ Из Подвиды Цикл

        Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПодвидДеятельности) Тогда
            Продолжить;
        КонецЕсли;

        Если Проверенные[СтрокаТЧ.ПодвидДеятельности] <> Неопределено Тогда
            ОбщегоНазначения.СообщитьПользователю(
                "Подвид """ + Строка(СтрокаТЧ.ПодвидДеятельности) + """ указан несколько раз",
                ЭтотОбъект,
                "Объект.Подвиды[" + Формат(Подвиды.Индекс(СтрокаТЧ), "ЧГ=0") + "].ПодвидДеятельности",
                , Отказ);
        КонецЕсли;

        Проверенные.Вставить(СтрокаТЧ.ПодвидДеятельности, Истина);

    КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

    РегистрыСведений.омг_ЛицензированныеВидыДеятельности.ОтразитьПриложение(ЭтотОбъект);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	 Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

    ПроверитьПравоНаОрганизацию(Отказ);
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
КонецПроцедуры 

Процедура ПроверитьПравоНаОрганизацию(Отказ)

    Если ПравоДоступа("Администрирование", Метаданные) Тогда
        Возврат;
    КонецЕсли;

    ОсновнаяОрганизация = ОсновнаяОрганизацияПользователя();

    Если НЕ ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(МедицинскийЦентр) Тогда
        Возврат;
    КонецЕсли;

    ОрганизацияМедцентра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
        МедицинскийЦентр, "Организация");

    Если ОрганизацияМедцентра <> ОсновнаяОрганизация Тогда
        ОбщегоНазначения.СообщитьПользователю(
            "Это приложение относится к другому филиалу. Изменять его нельзя. "
            + "Если считаете это ошибкой — обратитесь в головной офис.",
            ЭтотОбъект, "МедицинскийЦентр", , Отказ);
		КонецЕсли;
	

КонецПроцедуры 
Функция ОсновнаяОрганизацияПользователя()

    Возврат УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(
        ПараметрыСеанса.ТекущийПользователь,
        "омг_ОсновнаяОрганизация");

КонецФункции
